; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_1)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 - link
    angle0 angle10 angle20 angle30 angle40 angle50 angle60 angle70 angle80 angle90 angle100 angle110 angle120 angle130 angle140 angle150 angle160 angle170 angle180 angle190 angle200 angle210 angle220 angle230 angle240 angle250 angle260 angle270 angle280 angle290 angle300 angle310 angle320 angle330 angle340 angle350 - angle)
(:init
    (AngleOrd angle0 angle10)
    (AngleOrd angle10 angle20)
    (AngleOrd angle20 angle30)
    (AngleOrd angle30 angle40)
    (AngleOrd angle40 angle50)
    (AngleOrd angle50 angle60)
    (AngleOrd angle60 angle70)
    (AngleOrd angle70 angle80)
    (AngleOrd angle80 angle90)
    (AngleOrd angle90 angle100)
    (AngleOrd angle100 angle110)
    (AngleOrd angle110 angle120)
    (AngleOrd angle120 angle130)
    (AngleOrd angle130 angle140)
    (AngleOrd angle140 angle150)
    (AngleOrd angle150 angle160)
    (AngleOrd angle160 angle170)
    (AngleOrd angle170 angle180)
    (AngleOrd angle180 angle190)
    (AngleOrd angle190 angle200)
    (AngleOrd angle200 angle210)
    (AngleOrd angle210 angle220)
    (AngleOrd angle220 angle230)
    (AngleOrd angle230 angle240)
    (AngleOrd angle240 angle250)
    (AngleOrd angle250 angle260)
    (AngleOrd angle260 angle270)
    (AngleOrd angle270 angle280)
    (AngleOrd angle280 angle290)
    (AngleOrd angle290 angle300)
    (AngleOrd angle300 angle310)
    (AngleOrd angle310 angle320)
    (AngleOrd angle320 angle330)
    (AngleOrd angle330 angle340)
    (AngleOrd angle340 angle350)
    (AngleOrd angle350 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)

    (HasAngle angle180 link1)
    (HasAngle angle310 link2)
    (HasAngle angle90 link3)
    (HasAngle angle200 link4)
    (HasAngle angle60 link5)
)
(:goal
(and
    (HasAngle angle200 link1)
    (HasAngle angle290 link2)
    (HasAngle angle110 link3)
    (HasAngle angle160 link4)
    (HasAngle angle10 link5)
    )
)
)

; plan
1. (increase_angle link1 angle180 angle190)
   deleted: (hasangle angle180 link1) (hasangle angle310 link2) (hasangle angle90 link3) (hasangle angle200 link4) (hasangle angle60 link5)
   added: (hasangle angle190 link1) (hasangle angle320 link2) (hasangle angle100 link3) (hasangle angle210 link4) (hasangle angle70 link5)
   goals met: 0 of 5
2. (increase_angle link1 angle190 angle200)
   deleted: (hasangle angle190 link1) (hasangle angle320 link2) (hasangle angle100 link3) (hasangle angle210 link4) (hasangle angle70 link5)
   added: (hasangle angle200 link1) (hasangle angle330 link2) (hasangle angle110 link3) (hasangle angle220 link4) (hasangle angle80 link5)
   goals met: 2 of 5
3. (decrease_angle link2 angle330 angle320)
   deleted: (hasangle angle330 link2) (hasangle angle110 link3) (hasangle angle220 link4) (hasangle angle80 link5)
   added: (hasangle angle320 link2) (hasangle angle100 link3) (hasangle angle210 link4) (hasangle angle70 link5)
   goals met: 1 of 5
4. (decrease_angle link2 angle320 angle310)
   deleted: (hasangle angle320 link2) (hasangle angle100 link3) (hasangle angle210 link4) (hasangle angle70 link5)
   added: (hasangle angle310 link2) (hasangle angle90 link3) (hasangle angle200 link4) (hasangle angle60 link5)
   goals met: 1 of 5
5. (decrease_angle link2 angle310 angle300)
   deleted: (hasangle angle310 link2) (hasangle angle90 link3) (hasangle angle200 link4) (hasangle angle60 link5)
   added: (hasangle angle300 link2) (hasangle angle80 link3) (hasangle angle190 link4) (hasangle angle50 link5)
   goals met: 1 of 5
6. (decrease_angle link2 angle300 angle290)
   deleted: (hasangle angle300 link2) (hasangle angle80 link3) (hasangle angle190 link4) (hasangle angle50 link5)
   added: (hasangle angle290 link2) (hasangle angle70 link3) (hasangle angle180 link4) (hasangle angle40 link5)
   goals met: 2 of 5
7. (increase_angle link3 angle70 angle80)
   deleted: (hasangle angle70 link3) (hasangle angle180 link4) (hasangle angle40 link5)
   added: (hasangle angle80 link3) (hasangle angle190 link4) (hasangle angle50 link5)
   goals met: 2 of 5
8. (increase_angle link3 angle80 angle90)
   deleted: (hasangle angle80 link3) (hasangle angle190 link4) (hasangle angle50 link5)
   added: (hasangle angle90 link3) (hasangle angle200 link4) (hasangle angle60 link5)
   goals met: 2 of 5
9. (increase_angle link3 angle90 angle100)
   deleted: (hasangle angle90 link3) (hasangle angle200 link4) (hasangle angle60 link5)
   added: (hasangle angle100 link3) (hasangle angle210 link4) (hasangle angle70 link5)
   goals met: 2 of 5
10. (increase_angle link3 angle100 angle110)
   deleted: (hasangle angle100 link3) (hasangle angle210 link4) (hasangle angle70 link5)
   added: (hasangle angle110 link3) (hasangle angle220 link4) (hasangle angle80 link5)
   goals met: 3 of 5
11. (decrease_angle link4 angle220 angle210)
   deleted: (hasangle angle220 link4) (hasangle angle80 link5)
   added: (hasangle angle210 link4) (hasangle angle70 link5)
   goals met: 3 of 5
12. (decrease_angle link4 angle210 angle200)
   deleted: (hasangle angle210 link4) (hasangle angle70 link5)
   added: (hasangle angle200 link4) (hasangle angle60 link5)
   goals met: 3 of 5
13. (decrease_angle link4 angle200 angle190)
   deleted: (hasangle angle200 link4) (hasangle angle60 link5)
   added: (hasangle angle190 link4) (hasangle angle50 link5)
   goals met: 3 of 5
14. (decrease_angle link4 angle190 angle180)
   deleted: (hasangle angle190 link4) (hasangle angle50 link5)
   added: (hasangle angle180 link4) (hasangle angle40 link5)
   goals met: 3 of 5
15. (decrease_angle link4 angle180 angle170)
   deleted: (hasangle angle180 link4) (hasangle angle40 link5)
   added: (hasangle angle170 link4) (hasangle angle30 link5)
   goals met: 3 of 5
16. (decrease_angle link4 angle170 angle160)
   deleted: (hasangle angle170 link4) (hasangle angle30 link5)
   added: (hasangle angle160 link4) (hasangle angle20 link5)
   goals met: 4 of 5
17. (decrease_angle link5 angle20 angle10)
   deleted: (hasangle angle20 link5)
   added: (hasangle angle10 link5)
   goals met: 5 of 5
